---
kind: type
id: T:Autodesk.Revit.DB.NumberSystemDisplayRule
source: html/037d1070-f6e0-df3b-f7bf-91f645a9dddb.htm
---
# Autodesk.Revit.DB.NumberSystemDisplayRule

The available options for display of numeric values in the number system.

## Syntax (C#)
```csharp
public enum NumberSystemDisplayRule
```